{
    "home" : "Inicio",
    "about" : "Sobre",
    "portfolio" : "Portfolio",
    "resume" : "Resumo",
    "works" : "Trabalhos",
    "certifications" : "Certificados",
    "viewResume" : "Visualizar CV",
    "pdf" : "/assets/pdf/CV_Victor_Mota_pt_br.pdf",
    "homePage" : {
        "im_am" : "Eu Sou Victor Mota!",
        "description" : "Eu sou engenheiro de software e desenvolvedor de software baseado em Brasília, Brasil. Meu objetivo é ajudar a entregar o máximo de valor possível para meu empregador e seus clientes. Conheça um pouco mais de mim e minhas habilidades abaixo."
    },
    "aboutPage" : {
        "about" : "Sobre",
        "description" : "Meu nome é Victor, eu possuo bacharel em Engenharia de Software pela Universidade de Brasília(UnB). No mercado de trabalho, trabalhei por um ano e meio na Tata Consultancy Services(TCS) como desenvolvedor backend junior, utilizando JAVA com principal linguagem de desenvolvimento, mas graças a essa experiência, também aprendi Angular e Spring Boot. Possuo experiência com Java, JSP, JSF, Spring Boot, Java Android, Kotlin, Angular, Python Django, API Rest, além de metodologias ágeis como SCRUM e XP.",
        "contact" : "Meus Contatos",
        "nameField" : "Nome",
        "name" : "Victor Hugo Lopes Mota",
        "cityField" : "Cidade",
        "city" : "Brasília, Brasil",
        "phoneField" : "Celular",
        "phone" : "+55 61 994592869",
        "email" : "victormota042@gmail.com"
    },
    "resumePage" : {
        "educationField" : "Educação",
        "experienceField" : "Experiência",
        "skillsField" : "Habilidades",
        "education" : [
            {
                "key" : 1,
                "school" : "Universidade de Brasília",
                "degree" : "Bacharel em Engenharia de Software",
                "location" : "Brasília, Brasil",
                "duration" : "Agosto de 2013 - Março de 2021"
            },
            {
                "key" : 2,
                "school" : "Englishour",
                "degree" : "Certificado em Lingua Inglesa Nível B1+",
                "location" : "Dublin, Irlanda",
                "duration" : "Julho de 2022, Dezembro de 2022"
            }
        ],
        "experience" : [
            {
                "key" : 1,
                "company" : "Senado Federal",
                "title" : "Estagiário",
                "duration" : "Agosto de 2017 - Agosto de 2019",
                "location" : "Brasília, Brasil",
                "description" : "Auxiliar de funções do setor como agendamento de compromissos, trabalhos com HTML, CSS, JS e uso do Liferay para manutenção de páginas do Senado Federal. Além dessas funções, eu também trabalhei na parte de gerenciamento, monitoramento e mapeamento dos projetos com o uso da ferramenta Bizagi."
            }, 
            {
                "key" : 2,
                "company" : "Tata Consultancy Services",
                "title" : "Desenvolvedor Backend Java Júnior",
                "duration" : "Março de 2021 - Julho de 2022",
                "location" : "Brasília, Brasil",
                "description" : "Eu trabalhei no backend, com foco em tecnologias Java, e Angular. Neste trabalho eu era responsável por implementar, testar e se necessário realizar manutenções em sistemas do cliente. Neste trabalho usavamos uma adaptação da metodologia SCRUM, então os principais ritos como dailys diarias, revisão de sprints e para o desenvolvimento de códigos, eram realizados em equipes. Meu foco era o backend com Java, mas também desenvolvi utilizando JSP, JSF, Angular e Spring Boot."
            },
            {
                "key" : 3,
                "company" : "Sea Tecnologia",
                "title" : "Desenvolvedor Backend Java Júnior",
                "duration" : "Fevereiro de 2023 - Atual",
                "location" : "Brasília, Brasil",
                "description" : "Neste trabalho, eu trabalho exclusivamente com Java, utilizamos o SCRUM como métodologia de desenvolvimento e o framework Liferay como apoio para os entregavéis de software do cliente."
            }
        ]
    },
    "portfolioPage" : {
        "description" : "Veja Alguns Projetos Que Eu Desevolvi",
        "detail" : "Visualizar",
        "close" : "Fechar",
        "portfolio" : [
            {
                "key" : 1,
                "name" : "Escola - X - Backend",
                "description" : "Projeto desenvolvido utilizando Kotlin como backend REST. A ideia desse projeto era desenvolver um sistema que auxiliasse no gerenciamento escolar da vida do aluno, desde o momento em que ele entra, até o momento em que ele sai da escola.",
                "image" : "/assets/images/skills/kotlin.jpg",
                "link" : "https://github.com/MrVictor42/Escola-X-Backend"
            },
            {
                "key" : 2,
                "name" : "Escola - X - Frontend",
                "description" : "Projeto desenvolvido utilizando Angular como frontend do projeto Escola -X. A ideia desse projeto era desenvolver um sistema que auxiliasse no gerenciamento escolar da vida do aluno, desde o momento em que ele entra, até o momento em que ele sai da escola.",
                "image" : "/assets/images/skills/angular.png",
                "link" : "https://github.com/MrVictor42/EscolaX-Frontend"
            },
            {
                "key" : 3,
                "name" : "MyAn",
                "description" : "Projeto desenvolvido utilizando Kotlin como linguagem de desenvolvimento. Este projeto é exclusivo para dispositivos android e tinha como por objetivo mostrar os animes e mangas lançados diretamente do Japão a partir de uma requisição REST. Neste aplicativo é possível assistir episódios dos animes, desde que eles sejam liberados pela plataforma.",
                "image" : "/assets/images/skills/myan.jpeg",
                "link" : "https://github.com/MrVictor42/myan"
            },
            {
                "key" : 4,
                "name" : "Grata Frontend",
                "description" : "Projeto desenvolvido utilizando React como frontend do projeto Grata. Este trabalho foi meu Trabalho de Conclusão de Curso e tinha como objetivo gerenciar a vida de uma reunião. É um projeto gratuito que poderia ser utilizado como principal ferramente de acompanhamento de projetos.",
                "image" : "/assets/images/skills/react.jpg",
                "link" : "https://github.com/MrVictor42/Grata-Frontend-v2"
            },
            {
                "key" : 5,
                "name" : "Grata Backend",
                "description" : "Projeto desenvolvido utilizando Python Django como backend REST. A ideia desse projeto era desenvolver o backend do projeto Grata.",
                "image" : "/assets/images/skills/pythondjango.jpg",
                "link" : "https://github.com/MrVictor42/Grata-Backend-v2"
            },
            {
                "key" : 6,
                "name" : "Escola - X - App",
                "description" : "Projeto desenvolvido utilizando Java Android. Este projeto tinha como objetivo notificar os pais e responsáveis caso acontecesse algo com o filho ou caso este tomasse alguma advertência/suspensão na escola.",
                "image" : "/assets/images/skills/escola-x.jpg",
                "link" : "https://github.com/fga-eps-mds/2017.1-Escola-X.app"
            },
            {
                "key" : 7,
                "name" : "Sea TodoList - Backend",
                "description" : "Projeto desenvolvido utilizando Kotlin como backend REST. Este foi um desafio cujo o objetivo era realizar um todo list, mas que contém também uma autenticação JWT.",
                "image" : "/assets/images/skills/kotlin.jpg",
                "link" : "https://github.com/MrVictor42/Sea-TodoList-Backend"
            },
            {
                "key" : 8,
                "name" : "Sea TodoList - Angular",
                "description" : "Projeto desenvolvido utilizando Angular como frontend do projeto Sea Todo List.",
                "image" : "/assets/images/skills/angular.png",
                "link" : "https://github.com/MrVictor42/Sea-TodoList-Frontend"
            }
        ]
    }
}