{
  "main": {
    "name":"Victor Mota",
    "occupation":"Software Security Engineer",
    "description":"Eu sou de Brasília, Brasil. Sou engenheiro de software formado pela Universidade de Brasília (UnB). Sou uma pessoa que busca sempre por conhecer algo novo, que luta para alcançar os objetivos e quer alcançar novos horizontes.",
    "employer":"Shop Your Own Mortgage",
    "jobDescription":"full stack software engineer across the range of our products, as well being our lead security specialist",
    "image":"profile_pic.jpg",
    "bio":"Sou um cara tranquilo, com desejo de trabalhar, paixão por programação e por novos conhecimentos e experiências. Gosto de projetos, desde a sua fase de iniciação até a fase de encerramento. Atualmente não estou trabalhando, mas possuo o desejo de voltar a trabalhar com software. Possui o desejo de trabalhar e morar em outro país.",
    "contactmessage":"Have a project for me? Think I'd be a good fit for your team? I'd love to hear from you, give me a shout by email or by using the form below if you'd like to get in contact with me.",
    "email": "victormota042@gmail.com",
    "phone": "+55 (61) 99459-2869",
    "address":{
      "street":"Samambaia Norte",
      "city":"Brasília",
      "state":"Brasil",
      "zip": "72322006"
    },
    "resumedownload":"CV_Victor_Mota_Br.pdf",
    "social":[
      {
        "name":"facebook",
        "url":"https://www.facebook.com/MrVictor42/",
        "className":"fa fa-facebook"
      },
      {
        "name":"twitter",
        "url":"https://twitter.com/MrVictor142",
        "className":"fa fa-twitter"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/victor-hugo-mota-64665a145/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/mrvictor42/?hl=pt-br",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/MrVictor42/",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Eu sempre busco por aprender novas tecnologias, mas essas são as que mais me interessei e possuo mais conhecimento sobre",
    "education":[
      {
        "school":"Universidade de Brasília",
        "degree":"Bacharel em Engenharia de Software",
        "graduated":"Novembro de 2020",
        "description":"Em 2013, eu passei no vestibular para o curso de Engenharia de Software, na UnB, no campus do Gama. Foi meu primeiro contato com o programação e no início foi bem difícil, mas conforme foi passando o tempo, fui gostando cada vez mais do curso e consegui me formar. Neste curso, aprendi do básico da programação, ao desenvolvimento de projetos, passando por todos as fases, desde a iniciação até o encerramento. Aprendi sobre projetos, a programar, trabalhar em grupo, confiar nas pessoas e a superar cada vez mais meus medos e inseguranças."
      }
    ],
    "work":[
      {
        "company":"Senado Federal",
        "title": "Estagiário",
        "years": "Agosto de 2017 - Agosto de 2019",
        "description": "No Senado, eu trabalhei mais com frontend, então foi nesse tempo que aprendi mais sobre CSS, Javascript e principalmente sobre processos. Como no setor público se tem muitos projetos, uma das coisas que mais meus supervisores me ensinaram, foi a trabalhar com modelagem de processos, e como seguir suas fases. Foram dois anos incríveis."
      },
      {
        "company":"Banco do Brasil",
        "title":"Estagiário",
        "years":"Setembro de 2019 - Dezembro de 2019",
        "description":"No Banco do Brasil, foi um tempo mais curto, pois neste semestre estava trabalhando no trabalho de conclusão de curso e estava muito difícil conciliar a Universidade, TCC e estágio. Nesta empresa, trabalhei com um desenvolvimento de uma ferramenta interna do banco, utilizando Java Web, com o auxílio do Hibernate no banco de dados."
      }
    ],
    "skills":[
      {
        "name":"Git",
        "description":"Eu utilizo o git para qualquer projeto. Tenho utilizado o git para controle de I use Git for all of my projects so far. I have used Git for version control in small teams and have toyed around with contributing to Open Source Projects.",
        "image":"git.jpg"
      },
      {
        "name":"Java",
        "description":"Java foi a primeira linguagem que realmente gostei e que conheci ainda na faculdade. É uma das linguagens que possui maior familiaridade em termos de estrutura e padrões de projeto. Por se tratar de uma linguagem mais antiga, possui muitas ajudas na internet e uma comunidade ainda ativa.",
        "image":"java.jpg"
      },
      {
        "name":"React Js",
        "description":"Inicialmente não gostei muito da linguagem, mas como via amigos a utilizando, resolvi da mais uma chance e não me arrependi da escolha. É uma linguagem incrivel, com uma grande comunidade ativa, diversos tipos de trabalhos e problemas resolvidos. ",
        "image":"react.jpg"
      },
      {
        "name":"Python Django",
        "description":"No início, achei um pouco estranho a linguagem, mas com o tempo, comecei a gostar muito da linguagem. Mesmo com a possibilidade de poder fazer tanto o backend, quanto o frontend tudo com o python django, gostei mais da opção de usar apenas o backend como API Rest, que foi a opção que usei no desenvolvimento do meu TCC.",
        "image":"python_django.svg"
      },

      {
        "name":"Docker",
        "description":"Conheci essa tecnologia em uma disciplina da faculdade e fiquei impressionado o quanto ela é boa. Desde então, em praticamente todos os meus projetos, eu utilizo docker e isso diminuiu consideravelmente os problemas de configuração de ambiente que tinha nos projetos que participava.",
        "image":"docker.jpg"
      },
      {
        "name":"Bootstrap 4",
        "description":"Utilizei o Bootstrap, em um dos projetos que mais gostei de ter participado e em projetos menores. Gosto da quantidade de exemplos que o site disponibiliza e a quantidade de coisas legais que é possível ser feito.",
        "image":"bootstrap.jpg"
      },
      {
        "name":"Heroku",
        "description":"Eu utilizei o heroku como plataforma de hospedagem online gratuita no meu tcc e um outro trabalho da faculdade. É razoavelmente fácil configurar e de se utilizar e por esses motivos, eu gosto muito.",
        "image":"heroku.jpg"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Grata - Gerenciamento de Reuniões e Atas",
        "category":"Meu Projeto de Conclusão de Curso",
        "image":"react.jpg",
        "url":"https://grata-frontend.herokuapp.com/"
      },
      {
        "title":"Escola X",
        "category":"Projeto Realizado Para Ajudar Uma Escola Pública do Distrito Federal",
        "image":"escolaX.png",
        "url":"https://github.com/fga-eps-mds/2017.1-Escola-X"
      },
      {
        "title":"Prato Aberto",
        "category":"Contribuição de Código Aberto",
        "image":"sp.svg",
        "url":"https://github.com/MES-PratoAberto/SME-PratoAberto-Editor"
      }
    ]
  }
}